namespace BGTouristGuide.Data.DataImporters
{
    using Models;

    public class TouristSitesImporter : DataImporter
    {
        public override void Import(BGTouristGuideDbContext db)
        {
            ParentTouristSite bansko = new ParentTouristSite
            {
                Name = "Банско",
                Description = "Ба̀нско е град в Югозападна България. Той се намира в област Благоевград, в близост до Разлог и е административен център на община Банско. В XIX век е център на българщината в Пиринска Македония на територия, граничеща с гръцко и турско население. От Банско са родом българските народни будители Неофит Рилски и Паисий Хилендарски, както и поетът Никола Вапцаров. Днес градът е известен зимен курорт.",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite museumNikolaVaptsarov = new TouristSite
            {
                Name = "Музей \"Никола Вапцаров\"",
                Description = "Родната къща на поета Никола Вапцаров е превърната в музей през 1952г. След 3 реконструкции - 1960, 1979 и 1992 г. - сегашната експозиция е направена на високо професионално ниво и се отличава с нетрадиционния за мемориален музей метод на поднасяне на информацията.По указания на членовете на семейството на поета - майка му Елена, брат му Борис и сестра му Райна - отчасти е възстановена домашнобитовата среда и обстановката по време на неговото детство.Музея има 3 функционални части - видеозала в 2 помещения / с капацитет 40 места /, където е представено и родословното дърво на поета; автентична етнографска експозиция и видеозала - \"Поезията на Вапцаров\".В музея са изложени и копия от ръкописите на Вапцаров, първите публикации на неговите стихове, събрани по-късно в отделна стихосбирка.Във витрина се пазят костюмът, ризата и часовникът, носени от поета преди разстрела.Музеят разполага с готови беседи чрез видеоматериал на английски, немски, френски и руски език. Къщата - музей е обединена в един комплекс с Дома на изкуствата и поезията.",
                Address = "пл. Никола Вапцаров 1, Банско",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8379883,
                Longitude = 23.4859156
            };

            TouristSite houseMuseumNeofitRilski = new TouristSite
            {
                Name = "Къща - музей \"Неофит Рилски\"",
                Description = "Къщата е архитектурно-строителен и исторически паметник на културата с национално значение. Това е родната къща на Неофит Рилски /Бенината/. В нея той живее до 1811 г. Тя е типичен образец на банската архитектура от краяна XVII и началото на XIX в.Патриархът на новобългарското образование и просвета Неофит Рилски / роден1973 / учи иконопис при Тома Вишанов – Молера - основоположник на Банската художествена школа.Рисува в Рилския манастир, където по - късно става и монах.Целият му живот е отдаден на науката и просветата.Автор е на първата българска граматика / 1835 г./.Oт 1981 г.къщата функционира като музей.Състои се от две части - автентично запазената къща на бележития възрожденец с етнографска експозиция и документална експозиция, излагаща най - ценното от богатото наследство на Неофит Рилски - главно писма, снимки и книжовен материал.Във фонда се съхраняват над 400 документални и веществени материали.",
                Address = "ул. „Пирин“ 17, Банско",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8380079,
                Longitude = 23.4793495
            };

            TouristSite museumVilianovasHouse = new TouristSite
            {
                Name = "Музей \"Велянова къща\"",
                Description = "Веляновата къща е архитектурно - етнографски музей, чиято декоративна украса е обявена за паметник на културата с национално значение. Това е най-оригиналната банска укрепена къща от епохата на Възраждането, която е запазена и до наши дни.Веляновата къща в Банско е била собственост на богато семейство, но когато заможният й стопанин бил на път, нахлули разбойници и убили жена му.Той не се върнал повече в нея и къщата запустяла.През 1835 къщата е подарена от банскалии на Уста / майстор / Велян Огнев, поканен да участва в украсата и обзавеждането на храма \"Света Троица\".Той я изографисва отвътре и отвън, превръщайки я в истинско произведение на изкуството.Къщата е била много модерна за времето си двукатна къща, градена само от камък и дърво, с характерните две взаимосвързани в приземието скривалища и пет стаи на етажа с чардак.Голяма ценност представляват стенописната украса на \"Синята стая\", изкусната дърворезба на чардака / централната розета /, геометричните и растителни мотиви в югоизточната стая на южната фасада.В едно от приземните помещения е организирана етнографска изложба - базар, подобна на тази в Дома на изкуствата и поезията.",
                Address = "ул. „Велян Огнев“ 5, Банско",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8356431,
                Longitude = 23.4856903
            };

            TouristSite iconExposition = new TouristSite
            {
                Name = "Иконна изложба",
                Description = "Постоянната иконна изложба е уредена в най-старата и запазена сграда в Банско - 1749 г. Обявена е за паметник на културата. Къщата е изпълнявала функциите на женски метох към Хилендарския, а по-късно към Рилския манастир. В шест изложбени зали се проследява развитието на Банската иконописна школа от стенописи, в т.ч.от Рилския манастир.Изложбата разполага с готови беседи на английски, немски, френски и руски език и озвучаване с църковни песнопения. Иконната изложба, сполучливо настанена в сградата на възстановения метох, дава великолепна представа за наследството, оставили колоритните даровити творци от Банско през 18 и 19 век, което ги нарежда между най - високите постижения на българския творчески гений.Макар да си сътрудничат с другите културни центрове в страната / Самоков, Дебър и Трявна /, те запазват докрай самобитните стилови отлики на своето изкуство. Родоначалник на Банската художествена школа е Тома Вишанов, който се завръща със самочувствие след престоя си в няколко европейски страни.И повлиян от влечението и интереса си към мимолетното и трудноуловимото в изображенията на човека,смело експериментира.Най - добро доказателство за това е изключително ценната икона \"Благославящият Христос\", където Спасителят е нарисуван като испански благородник. Делото му е продължено от неговия син Димитър и внукът му Симеон Молерови.",
                Address = "ул. „Никола Й. Вапцаров“ 3, Банско",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8373587,
                Longitude = 23.4864712
            };

            TouristSite churchHolyTrinity = new TouristSite
            {
                Name = "Църква Св.Троица",
                Description = "Храмовият комплекс \"Света Троица\" е една от най-големите исторически и културни забележителности на град Банско.ÃÂ Църквата, която като архитектурен тип представлява трикорабна псевдо базилика и е една от най-големите в страната, е строена през 1835 г.от местни строители - Григор Доюв, Лазар Глушков по инициативата и с материалната подкрепа на влиятелния търговец Лазар Герман(Голев).ÃÂ Иконостасът и рисунките по колоните и свода в нея са дело на Велян Огнев - представител на Дебърската художествена школа, а иконите са изписани от прочутите майстори на Банската иконописна школа Димитър и Симеон Молерови.Църквата е образец на великолепен синтез между архитектурни обеми и пространства, дърворезба, фрескова живопис и икони.Нейният величествен силует прекрасно хармонира с изградената в непосредствена близост тридесет метрова часовникова кула - камбанария. Църквата е дълга 44 м, широка 22 м и е висока 9, 5 м.",
                Address = "пл. Възраждане, Банско",
                Status = ParentTouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8353889,
                Longitude = 23.4848986
            };

            bansko.SubTouristSites.Add(museumNikolaVaptsarov);
            bansko.SubTouristSites.Add(houseMuseumNeofitRilski);
            bansko.SubTouristSites.Add(museumVilianovasHouse);
            bansko.SubTouristSites.Add(iconExposition);
            bansko.SubTouristSites.Add(churchHolyTrinity);

            db.ParentTouristSites.Add(bansko);
        }
    }
}
