namespace BGTouristGuide.Data.DataImporters
{
    using Models;

    public class TouristSitesImporter : DataImporter
    {
        public override void Import(BGTouristGuideDbContext db)
        {
            #region Bansko
            ParentTouristSite bansko = new ParentTouristSite
            {
                Name = "Банско",
                Description = "Ба̀нско е град в Югозападна България. Той се намира в област Благоевград, в близост до Разлог и е административен център на община Банско. В XIX век е център на българщината в Пиринска Македония на територия, граничеща с гръцко и турско население. От Банско са родом българските народни будители Неофит Рилски и Паисий Хилендарски, както и поетът Никола Вапцаров. Днес градът е известен зимен курорт.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite museumNikolaVaptsarov = new TouristSite
            {
                Name = "Музей \"Никола Вапцаров\"",
                Description = "Родната къща на поета Никола Вапцаров е превърната в музей през 1952г. След 3 реконструкции - 1960, 1979 и 1992 г. - сегашната експозиция е направена на високо професионално ниво и се отличава с нетрадиционния за мемориален музей метод на поднасяне на информацията.По указания на членовете на семейството на поета - майка му Елена, брат му Борис и сестра му Райна - отчасти е възстановена домашнобитовата среда и обстановката по време на неговото детство.Музея има 3 функционални части - видеозала в 2 помещения / с капацитет 40 места /, където е представено и родословното дърво на поета; автентична етнографска експозиция и видеозала - \"Поезията на Вапцаров\".В музея са изложени и копия от ръкописите на Вапцаров, първите публикации на неговите стихове, събрани по-късно в отделна стихосбирка.Във витрина се пазят костюмът, ризата и часовникът, носени от поета преди разстрела.Музеят разполага с готови беседи чрез видеоматериал на английски, немски, френски и руски език. Къщата - музей е обединена в един комплекс с Дома на изкуствата и поезията.",
                Address = "пл. Никола Вапцаров 1, Банско",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8379883,
                Longitude = 23.4859156
            };

            TouristSite houseMuseumNeofitRilski = new TouristSite
            {
                Name = "Къща - музей \"Неофит Рилски\"",
                Description = "Къщата е архитектурно-строителен и исторически паметник на културата с национално значение. Това е родната къща на Неофит Рилски /Бенината/. В нея той живее до 1811 г. Тя е типичен образец на банската архитектура от краяна XVII и началото на XIX в.Патриархът на новобългарското образование и просвета Неофит Рилски / роден1973 / учи иконопис при Тома Вишанов – Молера - основоположник на Банската художествена школа.Рисува в Рилския манастир, където по - късно става и монах.Целият му живот е отдаден на науката и просветата.Автор е на първата българска граматика / 1835 г./.Oт 1981 г.къщата функционира като музей.Състои се от две части - автентично запазената къща на бележития възрожденец с етнографска експозиция и документална експозиция, излагаща най - ценното от богатото наследство на Неофит Рилски - главно писма, снимки и книжовен материал.Във фонда се съхраняват над 400 документални и веществени материали.",
                Address = "ул. „Пирин“ 17, Банско",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8380079,
                Longitude = 23.4793495
            };

            TouristSite museumVilianovasHouse = new TouristSite
            {
                Name = "Музей \"Велянова къща\"",
                Description = "Веляновата къща е архитектурно - етнографски музей, чиято декоративна украса е обявена за паметник на културата с национално значение. Това е най-оригиналната банска укрепена къща от епохата на Възраждането, която е запазена и до наши дни.Веляновата къща в Банско е била собственост на богато семейство, но когато заможният й стопанин бил на път, нахлули разбойници и убили жена му.Той не се върнал повече в нея и къщата запустяла.През 1835 къщата е подарена от банскалии на Уста / майстор / Велян Огнев, поканен да участва в украсата и обзавеждането на храма \"Света Троица\".Той я изографисва отвътре и отвън, превръщайки я в истинско произведение на изкуството.Къщата е била много модерна за времето си двукатна къща, градена само от камък и дърво, с характерните две взаимосвързани в приземието скривалища и пет стаи на етажа с чардак.Голяма ценност представляват стенописната украса на \"Синята стая\", изкусната дърворезба на чардака / централната розета /, геометричните и растителни мотиви в югоизточната стая на южната фасада.В едно от приземните помещения е организирана етнографска изложба - базар, подобна на тази в Дома на изкуствата и поезията.",
                Address = "ул. „Велян Огнев“ 5, Банско",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8356431,
                Longitude = 23.4856903
            };

            TouristSite iconExposition = new TouristSite
            {
                Name = "Иконна изложба",
                Description = "Постоянната иконна изложба е уредена в най-старата и запазена сграда в Банско - 1749 г. Обявена е за паметник на културата. Къщата е изпълнявала функциите на женски метох към Хилендарския, а по-късно към Рилския манастир. В шест изложбени зали се проследява развитието на Банската иконописна школа от стенописи, в т.ч.от Рилския манастир.Изложбата разполага с готови беседи на английски, немски, френски и руски език и озвучаване с църковни песнопения. Иконната изложба, сполучливо настанена в сградата на възстановения метох, дава великолепна представа за наследството, оставили колоритните даровити творци от Банско през 18 и 19 век, което ги нарежда между най - високите постижения на българския творчески гений.Макар да си сътрудничат с другите културни центрове в страната / Самоков, Дебър и Трявна /, те запазват докрай самобитните стилови отлики на своето изкуство. Родоначалник на Банската художествена школа е Тома Вишанов, който се завръща със самочувствие след престоя си в няколко европейски страни.И повлиян от влечението и интереса си към мимолетното и трудноуловимото в изображенията на човека,смело експериментира.Най - добро доказателство за това е изключително ценната икона \"Благославящият Христос\", където Спасителят е нарисуван като испански благородник. Делото му е продължено от неговия син Димитър и внукът му Симеон Молерови.",
                Address = "ул. „Никола Й. Вапцаров“ 3, Банско",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8373587,
                Longitude = 23.4864712
            };

            TouristSite churchHolyTrinity = new TouristSite
            {
                Name = "Църква Св.Троица",
                Description = "Храмовият комплекс \"Света Троица\" е една от най-големите исторически и културни забележителности на град Банско.ÃÂ Църквата, която като архитектурен тип представлява трикорабна псевдо базилика и е една от най-големите в страната, е строена през 1835 г.от местни строители - Григор Доюв, Лазар Глушков по инициативата и с материалната подкрепа на влиятелния търговец Лазар Герман(Голев).ÃÂ Иконостасът и рисунките по колоните и свода в нея са дело на Велян Огнев - представител на Дебърската художествена школа, а иконите са изписани от прочутите майстори на Банската иконописна школа Димитър и Симеон Молерови.Църквата е образец на великолепен синтез между архитектурни обеми и пространства, дърворезба, фрескова живопис и икони.Нейният величествен силует прекрасно хармонира с изградената в непосредствена близост тридесет метрова часовникова кула - камбанария. Църквата е дълга 44 м, широка 22 м и е висока 9, 5 м.",
                Address = "пл. Възраждане, Банско",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Latitude = 41.8353889,
                Longitude = 23.4848986
            };

            bansko.SubTouristSites.Add(museumNikolaVaptsarov);
            bansko.SubTouristSites.Add(houseMuseumNeofitRilski);
            bansko.SubTouristSites.Add(museumVilianovasHouse);
            bansko.SubTouristSites.Add(iconExposition);
            bansko.SubTouristSites.Add(churchHolyTrinity);

            db.ParentTouristSites.Add(bansko);
            #endregion

            #region Pirin
            ParentTouristSite pirin = new ParentTouristSite
            {
                Name = "Пирин",
                Description = "Пѝрин, още Пирѝн и Перѝн, е планина в Югозападна България, част от Рило-Родопския планински масив, с най-висок връх Вихрен (2914,3 м). Най-старото познато име на планината е Орбелус – белоснежна, познато ни от траките, докато славяните са я наричали Перин или Перун. Според тълкуването на академик Владимир Георгиев името на Пирин идва от тракийската дума „перинтос“, което означава скала, и от хетската „перунаш“.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite mountVihren = new TouristSite
            {
                Name = "Връх Вихрен",
                Description = "Връх Вихрен е висок 2914 м. На 1950 м. има метеорологична станция. Средните годишни валежи са 1150 мм, а снежната покривка достига до 3 м. Вихрен със своите 2914 метра е първенецът на Пирин. Траките наричали планината Орбелос / белоснежна /, а славяните отнача¬ло я назовавали Юденица / Самодивската /, а по - късно Перин, защото били убедени, че най - високият й връх е обитаван от самия бог Перун. Но според тълкуването на академик Владимир Георгиев името идва от тракийската дума \"перинтос\", което означава \"скала\", или от хетската \"перунаш\". До 1942 година Вихрен се е наричал Елтепе /връх на бурите/. Той е част от създадения в 1962 година едноименен национален парк, който в 1975 година получава името \"Пирин\". С площ от над 40,000 хектара паркът опазва уникалните ендемични, застрашени и редки растения, както и разнообразието от животински видове, които го обитават. През 1983 година е включен в списъка на световното природно и културно наследство на ЮНЕСКО. В подножието на планината се отбийте да видите Байкушевата мура, която носи името на своя откривател, лесовъда Коста Байкушев.Той изследва дървото през 1897 година и изчислява възрастта му на 1, 200 години тогава.Размерите му са наистина впечатляващи: височина 24 метра, диаметър 2 метра и 2 - сантиметра и обиколка почти осем. Пирин е изключително богат на живот. 1300 вида са висшите растения / което е една трета от всички познати в България/, 320 вида мъхове и няколкостотин вида водорасли. 18 на брой са локалните ендемитни растения, които се срещат само в Пирин.Още по-голямо е богатството от животински видове.Но не така стоят нещата при Вихрен.Защото той е втори по височина в България след Мусала и трети на Балканския полуостров след Митикас в Олимп / Гърция /.Изграден е от мрамори, които не задържат вода и точно затова в района на върха няма реки и езера.Растителността по склоновете му е бедна -трева и лишеи, но в замяна на това по скалния ръб Джамджиеви скали в изобилие се среща еделвайсът. По - богат е животинският свят - птици, дребни гризачи, но най - вече диви кози, които обитават местността Казаните в неговото подножие. Към самия връх водят няколко маршрута, но е най-добре да се тръгне от Банско към хижите \"Бъндерица\" и \"Вихрен\", които предлагат много добри условия за пребиваване. От хижа \"Вихрен\" започва така нареченият \"класически маршрут\" - основната пътека, известна като Царската.Но е хубаво да имате известна физическа подготовка, защото пътеката е стръмна - за кратко време се достига денивелация от почти километър нагоре.През лятото изкачването от хижата до върха трае около 3 - 4 часа, в зависимост от физическата кондиция на туристите.Безспорно именно тогава е най - доброто време за достигане челото на Вихрен. Не забравяйте добрата екипировка, защото в тази, пък и не само в тази планина времето даже през най-благоприятния сезон може да се промени бързо и рязко. Добре е и в хижата да са уведомени за вашето начинание, а батерията на мобилния ви телефон да бъде добре заредена. Но усилието си струва, защото ще бъдете богато възнаградени за него. От изключителната красота на Пирин - тази уж малка и компактна, но покоряваща с величието си планина.Ще откриете много очарование в дълбоките долини на Влахинска и Бъндеришка река, в смълчаните клекове, в играта на светлината и сенките. Средният годишен абсолютен минимум на температурите е между (-25 С) и(-21 С), а максималните температури са между 15 С и 23 С.До Вихрен може да се стигне по много пътища, но най-удобен и популярен е маршрутът от Банско.",
                Address = "България Пирин планина.",
                Latitude = 41.7672507,
                Longitude = 23.3813792
            };

            pirin.SubTouristSites.Add(mountVihren);

            db.ParentTouristSites.Add(pirin);
            #endregion

            #region Selo Dobursko
            ParentTouristSite vilageDobursko = new ParentTouristSite
            {
                Name = "Село Добърско",
                Description = "До̀бърско е село в Югозападна България. То се намира в община Разлог, Област Благоевград. През 2001 година в покрайнините на селото са открити останки от римска пещ за тухли и керемиди, датирани от археолозите от Благоевградския исторически музей към 3-4 век. Това са може би най-старите материални следи за историята на Добърско. Високо над сегашното селище има местност Германица.[1]До 1912 година името на селото е Недобърско.[2] Селото се споменава за пръв път като подвластно на Рилския манастир в Рилската грамота на цар Иван Шишман от 1378 година под името Гнидобрадско.В джелепкешански регистър от 1576 година е отбелязано под името Гнидобронска като вакъфско село.След процесите на потурчване в Разлога през втората половина на 17 век Добърско значително увеличава населението си с търсещи убежище в планината българи и до края на 18 век, преди издигането на Банско, Добърско е икономически водещото селище на Разложката котловина.По пасищата му се отглеждат големи стада добитък, които слизат през зимата на юг в полетата на Сяр и Драма, откъдето пък добърските търговци изнасяли памук за Босна, Сърбия, за Виена и Будапеща.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite churchSvSvTeodorTironAndTeodorStratilat = new TouristSite
            {
                Name = "Църква Св. Св. Теодор Тирон и Теодор Стратилат",
                Description = "Добърско е малко планинско село в Разложката котловина. То е старинно българско селище. Разположено е на предната част на планински хребет в южна Рила, място с надморска височина около 1000 м. Един от добре запазенитепаметници на културата в Добърско е старата църква \"Свети Теодор Тирон и Теодор Стратилат\" - 1614 г. Според една жизнена и днес легенда село Добърско било заселено от част от ослепените войници на цар Самуил след битката при село Ключ през 1014 година, дошли да дирят облекчение на своите болки от местно лековито изворче. Но истинската причина, поради която всеки бъпгарин трябва да посети това селце, което е само на 17 километра северно от общинския център - гр. Разлог, е необикновената черква със скромни размери, но с неоценима духовна стойност.Построена и изрисувана през 1614 година, тя е дълга осем и половина метра, широка почти седем и висока едва пет, с двускатен покрив, съобразно тогавашното османско законодателство.Но майсторите дръзко издълбали два кръста на нейната фасада.Както и свастика в един от каменните блокове.Този символ на слънцето и благоденствието е с древен ирански произход и според учените е дошъл тук с първите войнишки семейства - верните до смърт на българската държава прабългари, заселени на границата с Византия.Почти всички надписи по фреските са на български език, въпреки че официален в църковните институции по това време е гръцкият.",
                Status = TouristSiteStatus.ApprovedForVisiting,
                Address = "2799 село Добърско",
                Latitude = 41.970062,
                Longitude = 23.4750053
            };

            vilageDobursko.SubTouristSites.Add(churchSvSvTeodorTironAndTeodorStratilat);
            db.ParentTouristSites.Add(vilageDobursko);
            #endregion

            #region Melnik
            ParentTouristSite melnik = new ParentTouristSite
            {
                Name = "Град Мелник",
                Description = @"Мѐлник е град в Югозападна България. Той се намира в Област Благоевград, Община Сандански. Това е най-малкият град в България. Мелник се намира в планински район в югозападните поли на Пирин планина. Разположен е в живописна местност на 22 километра югоизточно от град Сандански на 437 метра надморска височина. Климатът е преходно средиземноморски с летен минимум и зимен максимум на валежите. Средната годишна валежна сума е около 670 мм. През градчето протича Мелнишката река, ляв приток на Струма. На 7 километра от него се намира Роженският манастир. За любителите на природата има пряка пътека, която минава през природния феномен Мелнишки пирамиди. Мелник е изходна точка и за хижа Пирин и хижа Малина.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite townHistoricalMuseum = new TouristSite
            {
                Name = "Градски исторически музей (История, етнография)",
                Description = "Градският исторически музей в Мелник е разположен в Пашовата къща, строена през 1815 г. и състояща се от каменно приземие и паянтов етаж със салон - общо 8 помещения. В приземния етаж на музея е показан основниятпоминък на този град и района - винопроизводството от местната мелнишка лоза. Показани са снимки на мелнишки изби, бъчви и др., свързани с обработката и съхраняването на мелнишкото вино.",
                Address = "ул. Рила 1,Благоевград",
                Latitude = 42.0204034,
                Longitude = 23.1010772,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite kordopulovHouse = new TouristSite
            {
                Name = "Кордопулова къща (нар. още Цинцарова къща)",
                Description = "Кордопуловата къща е построена през ХІХ век от заможен търговец. Тя е една от най-монументалните възрожденски къщи в страната. В нея е уредена експозиция на мелнишка изба, издълбана във вид на тунел в скалата, с експонирани в нея огромнибъчви за съхраняване на мелнишко вино. Показана е нейната вътрешна архитектура с украси от стенописи, резби и стъклописи.",
                Address = "2820 Melnik",
                Latitude = 41.5226517,
                Longitude = 23.3905839,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite svetorojenskiMonestery = new TouristSite
            {
                Name = "Светороженски манастир \"Рождество богородично\"",
                Description = "Роженският манастир е най-голямата обител в пиринския край и един от няколкото средновековни български манастири, запазени сравнително непокътнати и до днес. Манастирът е построен през ХІІІ в.Разположен е на около 5 км. от гр. Мелник в ниските части на Пирин. Той предлага изключителна гледка до върховете на Пирин и Беласица, както и до популярните мелнишки мелове – разположени около града пирамидални хълмове, образувани от ерозия на глинена почва.Сегашната манастирска сграда е от ХІХ в. Сама по себе си църквата е забележителен паметник на културата. Върху стенописите най-старият надпис е от 1597 г. Тя има интересен дърворезбен иконостас, стенописи и стъклопис в източната си част. В манастирската сграда е уредена експозиция.",
                Address = "Град Мелник",
                Latitude = 41.5317191,
                Longitude = 23.4132101,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            melnik.SubTouristSites.Add(townHistoricalMuseum);
            melnik.SubTouristSites.Add(kordopulovHouse);
            melnik.SubTouristSites.Add(svetorojenskiMonestery);

            db.ParentTouristSites.Add(melnik);
            #endregion

            #region Petrich
            ParentTouristSite petrich = new ParentTouristSite
            {
                Name = "Град Петрич",
                Description = "Пѐтрич е град в Югозападна България. Той се намира в Област Благоевград и е в близост до границата с Гърция. Градът е втори по големина в областта след Благоевград и е административен център на Община Петрич. Петрич е един от старите градове по долината на средна Струма. Според местни краеведи, днешния град Петрич е наследник на древното тракийско селище, разположено в южното подножие на възвишението Кожух. В тази местност, разположена на 10 км североизточно от съвременния град, през 4 век пр.Хр., възниква тракйско селище на племето меди. През 1 век пр.Хр. римляните завладяват земите на медите и тогава малкото селище при Кожух се превръща в добре укрепен римски град – крепост, който е опазвал средното течение на Струма и Рупелския пролом.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite rupite = new TouristSite
            {
                Name = "Местност \"Рупите\" - храм паметник \"Света Петка Българска\"",
                Description = "Местността Рупите, Петричко отдавна е придобила широка известност като мястото, в което се е зареждала с енергия и е приемала посетители най-популярната българска пророчица Вангелия Гущерова, наричана от народа – “Леля Ванга”.През 1992 г. пророчицата построява черквата \"Св.Петка Българска\", превърнала се веднага в място за поклонение за хиляди нуждаещи се хора. Иконите на иконостаса са рисувани от известния художник проф. Светлин Русев, като образите на светците са прекалено реалистични и не се одобряват от Св. Синод.Повечето от обикновените хора, обаче, ги харесват, за което свидетелства и нескончаемият поток от посетители. В близост може да се види и къщичката на леля Ванга. Цялата местност е облагородена и представлява едно прекрасно кътче на десния бряг на р. Струма, което има реални предпоставки в бъдеще да прерасне в манастир. Непосредствено до комплекса извира топла минерална вода с температура 78 0С и дебит 35 л/сек. Част от водата е каптирана и по тръбопровод е отведена до гр. Петрич. Останалата част образува гьолове, в които могат да се видят търсещи избавление от различни болести хора.",
                Address = "Град Петрич местност Рупите",
                Latitude = 41.4389719,
                Longitude = 23.2330173,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite fortressOfSamuil = new TouristSite
            {
                Name = "Национален парк-музей „Самуилова крепост“",
                Description = "Самуиловата крепост се намира на десния бряг на река Струмешница, в полите на Беласица. На това място през 1014 г. се е разиграла една от най-големите трагедии в историята на българската държава.При битка в околностите на крепостта византийският император Василий ІІ, наречен Българоубиец, разгромил българската войска, предвождана от цар Самуил и я пленил почти изцяло. Цар Самуил и неговото обкръжение едва успели да се спасят. Съобразно християнската доктрина, пленени християни трябва да бъдат освобождавани след края на войната. Византийският император потъпкал това военно правило и ослепил пленената 14-хилядна българска войска, като оставил на всеки сто души по един водач.Самуиловата крепост при село Ключ е място не само на една голяма трагедия, но и свидетелство за жестокост, непозната дотогава в историята, нечувано военно престъпление. Няма и не може да има друго определение за ослепяването на 14,000 обезоръжени и беззащитни пленници. Което е по-скоро повод за срам, нежели за гордост за Василий Втори, който напълно заслужава \"титлата\" не Българо, а Човекоубиец.",
                Address = "Град Петрич",
                Latitude = 41.3941966,
                Longitude = 23.0257603,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            petrich.SubTouristSites.Add(rupite);
            petrich.SubTouristSites.Add(fortressOfSamuil);
            db.ParentTouristSites.Add(petrich);
            #endregion

            #region Nesebur
            ParentTouristSite nesebur = new ParentTouristSite
            {
                Name = "Град Несебър",
                Description = "Несѐбър е град, разположен в Югоизточна България. Той се намира в община Несебър, област Бургас, в съседство на север с най-големия български черноморски курорт Слънчев бряг. Градът е административен център на община Несебър и е един от най-древните градове в Европа, възникнал преди повече от 3200 години.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite museumOfArcheology = new TouristSite
            {
                Name = "Археологически музей",
                Description = "Старият град е дълъг само 850 и широк 350 м. През различните периоди от своето съществуване е загубил 1/3 от територията си, която е пропаднала в морето. Останки от крепостните му стени и сега могат да се видят под водата на около 80 м от брега.До наши дни се е запазила единствено Западната крепостна стена с портата, която е отбранявала града откъм сушата.За първи път градът е включен в пределите на българската държава през 812 г., когато хан Крум завладява града и в него се заселват славяни и българи. За по-дълго време Несебър - както го наричат славяните е отново в български ръце в годините на царуването на цар Симеон Велики.От епохата на българското Възраждане в Несебър са останали доста къщи -типични представители на Черноморския тип къща, част от многото работили в града вятърни мелници, баня и чешми. От края на миналия век Несебър е малък град с основен поминък риболов и селско стопанство – предимно лозарство и ленопроизводство. От 1959 г., след построяването на Курортния комплекс “Слънчев бряг”, в града и околностите активно се развива международния туризъм. Археологическите проучвания на несебърския полуостров и неговата акватория през последните четири десетилетия разкриха богати колекции от значими паметници на културата, илюстриращи историята на антична Месамбрия и средновековен Несебър. Голяма част от тях са експонати в новия Археологически музей на Несебър. Музеят е открит през 1994 г. Експозиционната площ обхваща фоайе и 4 зали.",
                Address = "ул. „Месембрия“ 2, 8231 Несебър",
                Latitude = 42.6583757,
                Longitude = 27.7286314,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite museumOfSalt = new TouristSite
            {
                Name = "Музей на солта",
                Description = "В Поморие, древният Анхиало, морската сол се добива от незапомнени времена. Според българските историци, солниците са съществували още преди основаването на града – около V век пр. Хр. До 30-те години на ХХ век морска сол в Българиясе е добивала само в Поморие. В миналото солта е била рядкост и по някои местта е имала стойността на златото. Затова анхиалските солници са били предмет на спорове и войни. Музеят в Поморие е единственият в България и на Балканите специализиран музей за производството на сол чрез слънчево изпарение на морска вода. Открит е на 7 септември 2002 година. Създаден е с финансовата подкрепа на Европейския съюз чрез програма „Фар”. Намира се в района на стария град. Музеят представя древната анхиалска технология за производтво на морска сол. Той се състои от експозионна зала и 25 дка действащи солници. Разполага с уникална колекция от снимки от началото на миналия век, стари топографски карти, макети и автентични соларски съоръжения и инструменти. Солниците към музея произвеждат сол по същия начин, по който това е ставало в древността. Посетителите могат да видят „на живо” всички технологични операции, да разговарят със соларите, да усетят автентичната атмосфера на миналото.",
                Address = "Град Поморие, 8200",
                Latitude = 42.5655809,
                Longitude = 27.6296788,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite lakeOfPomorie = new TouristSite
            {
                Name = "Поморийско езеро",
                Description = "Поморийско езеро е естествена свръхсолена лагуна, разположена на българското Черноморско крайбрежие, в непосредствена близост до гр. Поморие.Влажната зона предлага рядко съчетание на условияза живот, които позволяват развитието на много рядък комплекс от соленолюбива растителност и животни приспособени към тази соленост, част от които могат да се видят единствено тук. Разположението на езерото на западния бряг на Черно море, по протежението на който преминава втория по големина миграционен път на птиците в Европа Via Pontica обуславя голямото разнообразие от птици (над 270 вида), което може да се наблюдава през различните сезони на годината. Богатото биологично разнообразие на Поморийско езеро и съхранения природен ландшафт са причина влажната зона и прилежащите територии да бъдат защитени съгласно българското (ЗМ Поморийско езеро) и международното природозащитно законодателство  включено е в Списъкът на влажните зони с международно значение към Конвенцията за опазването на влажните зони (Рамсарска конвенция) и в екологичната мрежа на ЕС - Натура 2000.",
                Address = "Град Поморие",
                Latitude = 42.5908229,
                Longitude = 27.587414,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            nesebur.SubTouristSites.Add(museumOfArcheology);
            nesebur.SubTouristSites.Add(museumOfSalt);
            nesebur.SubTouristSites.Add(lakeOfPomorie);
            db.ParentTouristSites.Add(nesebur);
            #endregion

            #region Burgas
            ParentTouristSite burgas = new ParentTouristSite
            {
                Name = "Град Бургас",
                Description = "Бургас е най-големият град в Югоизточна България и вторият по големина на българското Черноморие след Варна, а със своята площ от 253,644 km² той е и един от най-големите в страната. Според последното преоброяване на НСИ към 31 декември 2014 година [2] населението е 192 725 жители и така става четвъртият по големина град в страната. Бургас е най-важният икономически, транспортен, административен и културен център в Югоизточна България. Градът е административен център на едноименната община и област, както и седалище на регионални и национални институции.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite centerPoda = new TouristSite
            {
                Name = "Природозащитен център \"Пода\"",
                Description = "Местността Пода, намираща се на юг от Бургас, е обявена за защитена територия през 1989 г. със заповед на Министерството на околната среда и водите. Тя се стопанисва от Българското дружество да защита на птиците (БДЗП). Пода епървата защитена територия в България, създадена по предложение на БДЗП и предоставена за управление на неправителствена организация, като през годините се е утвърдила като модел за устойчива природозащита, екологично образование и природосъобразен туризъм. На територията на Пода от малко повече от 1 кв. км са установени 273 вида птици, което е повече от половината от всичките 420 вида, които се срещат в България въобще! Затова през 1997 г. Българското дружество за защита на птиците с помощта на Правителството на Швейцария изгради тук първия в България Природозащитен център (ПЗЦ) Пода като средище за природозащита, екологично образование, екотуризъм и орнитологична информация.За посещения защитената местност Пода е отворена целогодишно. В нея редките видове птици могат да бъдат наблюдавани без да бъдат обезпокоявани, както от терасите на Природозащитния център на БДЗП с бинокли и далекогледна тръба, така и по обособен маршрут. Има специално укритие, което дава възможност за наблюдение и фотографиране независимо от метеорологичните условия. Ежегодно в ПЗЦ на БДЗП Пода се провеждат проучвания върху мигриращите птици, а най-добрите месеци за наблюдение на мигрантите са март, април, май, август, септември и октомври. Интересни и редки видове птици, включително пеликани, морски орли, малки корморани и други обаче могат да се наблюдават по всяко време на годината.",
                Address = "Град Бургас",
                Latitude = 42.449055,
                Longitude = 27.451714,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite cathedralTemple = new TouristSite
            {
                Name = "Катедрален храм \"Свети свети Кирил и Методий\"",
                Description = "В античността Бургас е бил малък римски град, който носел името Деултум. През Средновековието тук била издигната малка крепост /Пиргос/, която била използвана за наблюдателница, и едва през XVII век градът получил сегашното си име. Но тогава никойне можел даже да подозира какво блестящо бъдеще го очаква. Най-много за неговото развитие допринася удобното му пристанище, както и съществуването на трите езера - Атанасовско, Бургаско и Мандренско.Един от главните символи на Бургас безспорно е катедралният храм \"Свети свети Кирил и Методий\", най - старата християнска обител в града.Основите му са положени през 1895 година, но бива завършен едва през 1907 - ма.Сградата - трикорабна базилика, иззидана от зелен айтоски камък, мрамор и тухли, впечатлява със своята пищна фасада.Не по - малко разкошна е и вътрешната му украса.Веднага се хвърлят в очи петте мраморни арки, които сякаш го разделят на две, иконостасът, изработен през 1930 година от майстора - дърводелец Крум Кошаревски, великолепните стенописи и прекрасните икони като \"Свети Седмочисленици\", \"Света Богородица\", \"Свети Йоан Рилски Чудотворец\" и много други, по-голямата част от които дарени на храма. За съжаление през 1953 година пожар поврежда много от тези безценни творения и едва през 2008 година на катедралния си празник 11 май обновената светиня най-после отваря врати.",
                Address = "Град Бургас, пл. Св. Св. Кирил И Методий",
                Latitude = 42.4961964,
                Longitude = 27.4718462,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            burgas.SubTouristSites.Add(centerPoda);
            burgas.SubTouristSites.Add(cathedralTemple);
            db.ParentTouristSites.Add(burgas);
            #endregion

            #region Malko Turnovo
            ParentTouristSite littleTurnovo = new ParentTouristSite
            {
                Name = "Град Малко Търново",
                Description = "Ма̀лко Тъ̀рново е град в Югоизточна България близо до границата с Турция и център на едноименната община в Област Бургас. Първото селище на мястото на днешно Малко Търново е тракийско. При византийсикя император Константин местността се развива културно и икономически поради близостта си със столицата на Византия, Константинопол.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite historicalMuseumOfMalkoTurnovo = new TouristSite
            {
                Name = "Исторически музей",
                Description = "Историческият музей в град Малко Търново се явява основен пазител и популяризатор на наследството от древността. Създаден през 1983 г. той разполага своите богатства в три странджански къщи от края на 19 век - паметници на културата. В тях са подредени разнообразни, интересни и атрактивни експозиции.Първият музей в гр. Малко Търново е създаден през 1983 г. под името „Музеен комплекс Странджа” и е резултат от интензивната работа в района по програмата Странджа-Сакар. През 2002 г. е преструктуриран в Общински Исторически музей и до днес е единствения културен институт в сърцето на Странджа планина. Експозиционната площ е разположена в четири странджански възрожденски къщи – паметници на културата, които са принадлежали на богатите търговски фамилии Дякови и Илиеви от края на ХІХ век. Къщата на кап. Стамат Икономов – един от идеолозите на Преображенското възтание, отвори врати в началото на 2010г. като Етнографска къща-музей. Исторически музей Малко Търново представя шест експозиции - в първата са подредени археологическите паметници, открити през последните десетилетия в обектите около и в града. По-голямата част от археологическите обекти са разкрити по времето на програма Странджа-Скар, с ръководител проф. Александър Фол. Ето защо в тази експозиция представяме на своите постители малка документална изложба в негова памет. Епиграфските паметници са подредени в лапидариум в двора на музея. Иконната живопис е представена в отделна експозиция с образци от странджански майстори. Специално място е отделено на новата история и Преображенското въстание, а в етнографската сбирка са събрани автентични предмети и облекла за източно-рупската етнографска област, към която се отнася Малкотърновският регион. В Природната сбирка ви очаква вълнуваща среща със странджанската природа - използвайте телефонната кабина, за да “поговорите” с птиците, запишете се в необичаен “езиков курс” и ако не ви е страх, влезте в „Тъмната стая”, за да усетите странджанската нощна гора.",
                Address = "Град Малко Търново, ул. К. Петканов 1А",
                Latitude = 41.979404,
                Longitude = 27.5239113,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite petrovaField = new TouristSite
            {
                Name = "Местност Петрова нива",
                Description = "Едно от най-свещените места в Странджа е местността Петрова нива, на 20 километра от Малко Търново. На Преображение /11-13/ юни 1903 година именно там 47 делегати на конгреса на Вътрешната революционна организация на българите от Тракиявзимат историческото решение да подкрепят избухналото по-рано в Македония Илинденско въстание. 26 дни зле въоръжените патриоти се сражават с 40-хилядна редовна турска армия и башибозушки орди. Въстанието е потушено с нечувана жестокост, избити са хиляди старци, жени и деца, изгорени повече от 60 села. Оцелелите напускат родния край и търсят спасение в свободна България.За да се увековечи спомена за саможертвата на въстаниците и стремежа им към национално освобождение, на 16 август 1958 г. на Петрова нива е открит паметник, а през 2003-та е построена и църквата \"Света Петка\".Музейна експозиция припомня за героичните събития чрез богат снимков материал, документи и експонати, а всяка година там се провежда и Национален възпоменателен събор.",
                Address = "Село Стоилово",
                Latitude = 42.035439,
                Longitude = 27.515913,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite archeologicalMuseumOfSozopol = new TouristSite
            {
                Name = "Град Созопол Археологически музей",
                Description = "Десетилетия наред от дълбините на морето край град Созопол и прилежащите острови леководо-лазните археологически експеди¬ции изваждат на свят безброй предмети, които възкресяват по убедителен начин миналото на едно от най-забеле-жителните селища по българското Черно¬морско крайбрежие, което през античността е било толкова могъщо и значимо, че го нарекли Аполония Магна /Велика/. Градът бил благоустроен и защитен от здрави крепостни стени. Централният площад, който вероятно тогава бил на днешния остров \"свети Свети Кирик и Юлита\", бил украсен със статуи на божества, сред които древните автори споменават внушителната 13 - метрова бронзова скулптура на Аполон.През 72 година преди Христа обаче градът бил превзет от легионите на Марк Лукул, които разрушили стените, опожарили града и отнесли със себе си прочутата статуя.За всичко това и за още много други важни периоди и факти свидетелстват колекциите на археологическия музей в Созопол, създаден през 1961 година в предоставената от Светия синод сграда на храм \"Свети Кирил и Методий\".От август 1978 година за същата цел на музея били предоставени зали и в Културния дом на града.",
                Address = "Град Созопол, ул. Хан Крум 2",
                Latitude = 42.42182,
                Longitude = 27.6905767,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite museumOfHistoryOfTsarevo = new TouristSite
            {
                Name = "Град Царево Общински историески музей",
                Description = "Историческият музей в град Царево е най-големият музей на юг от областния град Бургас.Отваря врати на 06.12.2012г. като културна институция, която да съхрани и популяризира наследството на Крайморска Странджа. В музея са експонираниархеологически находки, датиращи от преди три хилядолетия и уникалните съкровища от село Синеморец. Сребърното монетно съкровище, открито през септември 2012г., се състои 199 тетрадрахми. Сред тях са изключително редките монети на тракийския цар Мостис. До 1991г. в науката са познати само 11 сребърни монети на този цар, съхранявани в нумизматични колекции в Париж, Ню Йорк и Ермитажа. В нашия музей те са 36. Златното съкровище - накити на видна тракийка, е шедьовър на елинистическото ювелирно изкуство от III в. пр.Хр.Предстои да се обособи отдел етнография с акцент - нестинарството, вписано в Представителния списък на ЮНЕСКО, като нематериално културно наследство на човечеството. Музеят е домакин на гостуващи експозиции и изложби на частни колекционери.",
                Address = "ул. „Пенека“ 12,Царев ",
                Latitude = 42.1715398,
                Longitude = 27.8500724,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            littleTurnovo.SubTouristSites.Add(historicalMuseumOfMalkoTurnovo);
            littleTurnovo.SubTouristSites.Add(petrovaField);
            littleTurnovo.SubTouristSites.Add(archeologicalMuseumOfSozopol);
            littleTurnovo.SubTouristSites.Add(museumOfHistoryOfTsarevo);
            db.ParentTouristSites.Add(littleTurnovo);
            #endregion

            #region Varna
            ParentTouristSite varna = new ParentTouristSite
            {
                Name = "Град Варна",
                Description = "Ва̀рна е град в североизточна България, разположен по бреговете на Черно море и Варненското езеро и административен център на едноименните община и област. Той е най-големият град в Северна България и по българското Черноморие. Населението на града по данни на НСИ към 31.12.2014 г. се изчислява на 335 949 души, което поставя Варна на трето място по големина в България след София и Пловдив. На територията му е разположено Адмиралтейството на Българската армия.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite navyMuseumOfVarna = new TouristSite
            {
                Name = "Военноморски музей",
                Description = "Историята на музея започва през 1883 г., когато офицери от Дунавската флотилия в Русе започват да събират старини. От създаването му до 1955 г. се нарича „Mорски музей”, а първата му публична експозиция е открита през 1923 г. В сегашнатасграда се помещава от 1955 г., когато минава под ведомството на Министерството на отбраната и е наречен Военноморски музей. В експозицията на музея са включени почти 1000 експоната, което е едва един процент от богатството във фондовете му. Тя проследява хронологически корабоплаването по бреговете на нашите земи от дълбока древност. Каменните котви са свидетелства за корабоплаването край западния черноморски бряг от времето на похода на аргонавтите и на троянските войни. Възстановка на товарен отсек на античен кораб, натоварен с амфори, допълва представите ни за далечните времена на гребното корабоплаване. Възстановка на оръдейна палуба на военен ветроход от ХVІІІ век предлага чрез картинни, фото пана и звукови ефекти на морска битка, да се възприеме по-пълно кораба като бойно средство. Но оригиналните предмети са незаменими по въздействие с автентичността си – находки от морското дъно, дула на корабни оръдия, рудан от ветроходен кораб, корабно оборудване, оръжия. В музея можете и да се „гмурнете” под морското равнище чрез възстановката на морско дъно.",
                Address = "бул. „Приморски“ 2, Варна",
                Latitude = 43.2002978,
                Longitude = 27.9193611,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite regionalHistoricalMuseumOfVarna = new TouristSite
            {
                Name = "Регионален исторически музей",
                Description = "Заслугата за създаването на Регионалния исторически музей - Варна през далечната 1887 година принадлежи на неуморните пионери на българската археология, братята Карел и Херман Шкорпил. След многобройни митарства, едва през1993 година, той най-сетне заема цялата сграда на някогашната Девическа гимназия и в 32 зали на площ 2000 кв. метра разгръща част от богатствата, събирани десетилетия.В неговите фондове се пазят повече от 100,000 предмета, открити във Варна, региона и цяла Североизточна България. Не може да се изброи всичко и все пак ето няколко примера: кремъчни сечива, върхове за стрели, антропоморфни и зооморфни фигурки, безчислено количество керамични съдове, изумителните находки от Варненския енеолитен некропол, където количеството открито злато надвишава по брой и тегло всички праисторически съкровища в света от същата епоха, взети заедно, както и намерените скиптри - сигурен белег, че покойниците са били облечени с висша светска или духовна власт. От времето на траките - бронзови украси и оръжия от желязо, накити от сребро и злато, керамика. От Одесос през елинистическата епоха - красиви златни накити, дървени саркофази, украсени с теракотени фигури, бронзови и стъклени съдове, бронзови, сребърни и златни монети.",
                Address = "бул. Мария Луиза 41, Варна",
                Latitude = 43.2073944,
                Longitude = 27.9127744,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            varna.SubTouristSites.Add(navyMuseumOfVarna);
            varna.SubTouristSites.Add(regionalHistoricalMuseumOfVarna);
            db.ParentTouristSites.Add(varna);
            #endregion

            #region Devnq
            ParentTouristSite devnq = new ParentTouristSite
            {
                Name = "Град Девня",
                Description = "Девня е град в Североизточна България. Той се намира в община Девня, Област Варна и е в близост до град Провадия. Старото му име е Девне. Градът е трети по големина в областта след Варна и Провадия и е административен център на Община Девня. Девня е трети по големина град в областта. Намира се на 22 километра западно от областния град-Варна, 18 километра североизточно от град Провадия. Намира се на Провадийското плато на най-източната точка от платото.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite museumOfMosaics = new TouristSite
            {
                Name = "Музей на мозайките",
                Description = "Музеят на мозайките в Девня представя римски и ранновизантийски мозайки от Марцианопол (Marcianopolis). Изграден е върху част от античните основи на сградата с мозайки2, строена в края на III – началото на IV век (времето на Константин IВелики) на мястото на по-ранна сграда (сгради) разрушена при готските нашествия през 250–251 г. Сградата заема площта на цял квартал с дължина 37,15 м и ширина 37,75 м . Нейният план следва традициите на гръко-римското атриумно-перистилно жилище. Около вътрешен двор, настлан с каменни плочи, със зидан кладенец по средата , заобиколен от три страни с покрита галерия с варовикова колонада , са разположени 21 жилищни, стопански и складови помещения с обща площ от 1402 кв. м. Стените на жилищните помещения са били покрити с цветни мазилки и стенописи, с гипсови щукатури. Пет от помещенията на сградата и портика са покрити с многоцветни подови мозайки – едни от най-добрите образци на римското мозаечно изкуство от това време, открити в България.",
                Address = "Град Девня",
                Latitude = 43.2255849,
                Longitude = 27.5829356,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            devnq.SubTouristSites.Add(museumOfMosaics);
            db.ParentTouristSites.Add(devnq);
            #endregion

            #region Veliko Turnovo
            ParentTouristSite velikoTurnovo = new ParentTouristSite
            {
                Name = "Град Велико Търново",
                Description = "Велѝко Тъ̀рново е град, намиращ се в Северна България, център на едноименната област и Северен централен регион. Градът е столица на Втората българска държава и благодарение на богатото си културно-историческо наследство е важен туристически център. До 1965 г. градът носи името Търново, когато пред него е добавено Велико заради предишната му слава. Градът е на 16-то място по население с 70 686 жители по настоящ адрес (15.09.2015) [1] и един от четирите града в България с положителен естествен прираст от 2006 до 2014 г. Разположен е между Дунавската равнина и Стара планина, върху първите възвишения на Предбалкана. Търново е основен административен, индустриален и образователен център на региона.",
                Type = ParentTouristSiteType.GovernemtDefined
            };

            TouristSite fortressTsarevets = new TouristSite
            {
                Name = "Царевец",
                Description = "Този град, сърцето на средновековната българска държава, бил наричан \"Царевград Търнов\", \"Трети Рим\", \"Втори Константинопол\" и го сочели като един от най - могъщите и големи градове в Югоизточна Европа през XII - XIV век, който поддържал оживенитърговски връзки с Генуа, Венеция, Дубровник и още много други.Център на върховното управление на държавата бил силно укрепеният хълм Царевец, до който можело да се достигне само от запад.Доминиращо място в крепостта заемали Дворцовият и Патриаршеският комплекс.Дворецът на българските царе е бил най - внушителният и монументален ансамбъл в столицата, където живеели владетелите и техните приближени, които осъществявали цялостната политика на държавата.С площ от 2872 кв.метра, той бил защитен от мощни крепостни стени и кули.В дворцовата църква били положени мощите на най - почитаната от българите светица - Света Петка Търновска, и пак в нея били погребани някои от българските владетели, стояли начело на държавата през XIV век.Патриаршеският комплекс заема площ от 2413 кв.метра.Оттук, от \"Майката на всички църкви\" се осъществявало управлението на духовния живот. В него са се намирали библиотеката, скрипторият, жилищните и служебни помещения, килиите на монасите. Днес може да се посети напълно реставрираният патриаршески храм \"Възнесение Господне\", чиято кула - камбанария се вижда от което и да било място в старопрестолния град. Вътрешността на храма е украсена с мащабни композиции, дело на Теофан Сокеров, които представят личности и важни моменти от нашата средновековна история.Експозицията е изцяло със светски характер.",
                Address = "Площад Цар Асен, Велико Търново",
                Latitude = 43.0837851,
                Longitude = 25.6498559,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite arbanasi = new TouristSite
            {
                Name = "Арбанаси",
                Description = "В никакъв случай не бива да пропускате и близкото до Велико Търново село Арбанаси, основано още през XIV век, което неслучайно е включено в списъка на световното културно наследство на ЮНЕСКО. Селище с оригинална архитектура, църкви и къщи сбогата вътрешна украса, живопис и дърворезба от XVI-XVII век. Какво трябва непременно да се види тук? Църквата \"Рождество Христово\", най - старата и най - голямата по площ, чиито стенописи са от неизвестни български майстори - зографи, като най - старата живопис е от XV - XVI век.И още \"Свети Архангели Михаил и Гавраил\", изградена върху основите на стара средновековна църква и довършвана на три етапа. Разположена е в красив притихнал двор, което й придава допълнително очарование. Посетете поне Констанцалиевата и Хаджиилиевата къща, макар че в Арбанаси 36 къщи са паметници на културата. А ако имате време, се отбийте и до Девическия манастир \"Свето Успение Богородично\", за да се докоснете до чудотворната икона на \"Богородица Троеручица\" със сребърен нимб.",
                Address = "Архитектурно-музеен резерват Арбанаси, Велико Търново",
                Latitude = 43.0985565,
                Longitude = 25.6609895,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            TouristSite regionalHistoricalMuseumOfVelokoTurnovo = new TouristSite
            {
                Name = "Регионален исторически музей",
                Description = "Във Велико Търново е и най-старият /основан още през 1871 година/ и най-големият извънстоличен общоисторически музей.Отделите \"Археология\", \"Етнография\", \"Християнско изкуство\", \"Българските земи през XV - XIX век\", \"Новаи най - нова история\" и неговите фондове съхраняват над 200,000 експоната от праисторията до днес. Немалка част от тях са уникати с национално и европейско значение като: Хотнишкото златно съкровище, златни накити от тракийски надгробни могили, сребърни и златни монети, сечени от различни владетели, мраморни статуи, средновековни пръстени-печати, стенописи - шедьоври на християнското изкуство от XII до XIX век, икони и църковна утвар. В музея се пази \"Неделникът\" на Софроний Врачански, да не говорим за колекции от ордени, медали, накити, тъкани, керамика, обредни предмети и мн.др.!",
                Address = "Град Велико Търново",
                Latitude = 43.0841053,
                Longitude = 25.5981804,
                Status = TouristSiteStatus.ApprovedForVisiting
            };

            velikoTurnovo.SubTouristSites.Add(fortressTsarevets);
            velikoTurnovo.SubTouristSites.Add(arbanasi);
            velikoTurnovo.SubTouristSites.Add(regionalHistoricalMuseumOfVelokoTurnovo);
            db.ParentTouristSites.Add(velikoTurnovo);
            #endregion
        }
    }
}
